<html>
<head>
  <title>Visor interno</title>
  <link href="../style.css" rel="stylesheet" type="text/css" />
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />
</head>
<body>

<h1>Visor interno</h1>

<p>Puede abrir el visor interno mediante el comando <b>Funciones &gt; <img src="../../icons/view-16.png" /> Visualizar</b> (<b>F3</b>). Reconoce autom&aacute;ticamente el formato del archivo y lo muestra en uno de los siguientes modos:</p><ul><li>Texto</li>
<li>Binario</li>
<li>Imagen</li></ul><p>Puede cambiar entre estos modos con las teclas <b>1</b>, <b>2</b> y <b>3</b> o los botones de la barra de herramientas. Puede actualizar el archivo para que se muestren los &uacute;ltimos cambios con el comando <b><img src="../../icons/refresh-16.png" /> Recargar</b> (<b>Ctrl+R</b>).</p>

<p>En el modo de texto, se muestra el archivo con la codificaci&oacute;n detectada autom&aacute;ticamente, ya sea UTF-8, ANSI (la codificaci&oacute;n por defecto de Windows), Unicode o Unicode BE (big indian). Puede seleccionar la codificaci&oacute;n adecuada desde el men&uacute; <b><img src="../../icons/word-wrap-16.png" /></b><b> Codificaci&oacute;n</b> si no se ha detectado correctamente. Tambi&eacute;n puede seleccionar y copiar un fragmento de texto al Portapapeles, y activar y desactivar el ajuste de l&iacute;neas largas al tama&ntilde;o de la pantalla con la opci&oacute;n <b><img src="../../icons/find-text-16.png" /> Ajuste de l&iacute;nea</b> (<b>W</b>). Tambi&eacute;n puede utilizar el comando <b><img src="../../icons/word-wrap-16.png" /> Buscar</b> (<b>Ctrl+F</b>) para buscar texto r&aacute;pidamente en la barra de b&uacute;squeda. Tambi&eacute;n puede ir a una l&iacute;nea especifica con el comando <b><img src="../../icons/encoding-16.png" /> Ir a la l&iacute;nea (<b>Ctrl+G</b>)</b>.</p>

<p>En el modo binario, el archivo se muestra con un n&uacute;mero fijo de 80 bytes por fila, con los caracteres que no se pueden imprimir sustituidos por un punto. Puede activar la opci&oacute;n <img src="../../icons/hex-mode-16.png" /></b><b> Hexadecimal</b> (<b>H</b>) para mostrar 16 bytes por l&iacute;nea, junto con el desplazamiento y el valor hexadecimal de cada byte. Tambi&eacute;n puede seleccionar y copiar un fragmento de texto al Portapapeles en este modo.</p>

<p>El modo imagen puede mostrar los siguientes formatos: PNG, JPEG, GIF, BMP, TIFF, ICO o SVG. Puede copiar la imagen completa al Portapapeles. Puede activar la opci&oacute;n <b><img src="../../icons/fullscreen-16.png" /></b><b> Ajustar a pantalla</b> (<b>F</b>) para reescalar autom&aacute;ticamente al tama&ntilde;o de la ventana si la imagen es demasiado grande. Puede acercar la imagen, alejarla, girarla 90ยบ a ambos lados y cambiar el color de las zonas transparentes de la imagen. Tambi&eacute;n puede cambiar el visor al modo de pantalla completa con el comando <b>Pantalla completa</b> (<b>F11</b>).</b>

<p>Resumen de los atajos de teclado del visor interno:</p>

<table width="100%">
<tr>
 <th>Tecla</th>
 <th width="20"></th>
 <th>Funci&oacute;n</th>
</tr>
<tr>
 <td>1</td>
 <td><img src="../../icons/type-text-16.png" /></td>
 <td>Cambiar al modo de texto.</td>
</tr>
<tr>
 <td>2</td>
 <td><img src="../../icons/type-binary-16.png" /></td>
 <td>Cambiar al modo binario.</td>
</tr>
<tr>
 <td>3</td>
 <td><img src="../../icons/type-image-16.png" /></td>
 <td>Cambiar al modo de imagen.</td>
</tr>
<tr>
 <td>A</td>
 <td></td>
 <td>Seleccionar codificaci&oacute;n ANSI (solo en modo de texto).</td>
</tr>
<tr>
 <td>B</td>
 <td><img src="../../icons/black-background-16.png" /></td>
 <td>Cambiar el color de las zonas transparentes de la imagen entre blanco y negro.</td>
</tr>
<tr>
 <td>F</td>
 <td><img src="../../icons/zoom-fit-16.png" /></td>
 <td>Ajustar la imagen al tama&ntilde;o de la pantalla (solo en modo imagen).</td>
</tr>
<tr>
 <td>H</td>
 <td></td>
 <td>Activar o desactivar el modo hexadecimal (solo en modo binario).</td>
</tr>
<tr>
 <td>L</td>
 <td><img src="../../icons/rotate-left-16.png" /></td>
 <td>Girar la imagen en sentido antihorario (solo en modo imagen).</td>
</tr>
<tr>
 <td>O</td>
 <td></td>
 <td>Seleccionar codificaci&oacute;n OEM (solo en modo de texto).</td>
</tr>
<tr>
 <td>R</td>
 <td><img src="../../icons/rotate-right-16.png" /></td>
 <td>Rotar la imagen en el sentido de las agujas del reloj (solo en modo de imagen)</td>
</tr>
<tr>
 <td>U</td>
 <td></td>
 <td>Seleccionar la codificaci&oacute;n UTF-8 (solo en modo de texto).</td>
</tr>
<tr>
 <td>W</td>
 <td></td>
 <td>Activar o desactivar el ajuste de l&iacute;nea (solo en modo de texto).</td>
</tr>
<tr>
 <td>F3</td>
 <td><img src="../../icons/find-next-16.png" /></td>
 <td>Buscar la siguiente repetici&oacute;n del texto buscado (solo en modo de texto).</td>
</tr>
<tr>
 <td>Shift+F3</td>
 <td><img src="../../icons/find-previous-16.png" /></td>
 <td>Buscar la anterior repetici&oacute;n del texto buscado (solo en modo de texto).</td>
</tr>
<tr>
 <td>F11</td>
 <td><img src="../../icons/fullscreen-16.png" /></td>
 <td>Pasar al modo a pantalla completa.</td>
</tr>
<tr>
 <td>ESC</td>
 <td></td>
 <td>Cerrar la ventana del visor.</td>
</tr>
<tr>
 <td>Ctrl+-</td>
 <td><img src="../../icons/zoom-out-16.png" /></td>
 <td>Alejar la imagen (solo en modo imagen).</td>
</tr>
<tr>
 <td>Ctrl+=</td>
 <td><img src="../../icons/zoom-in-16.png" /></td>
 <td>Acercar la imagen (solo en modo imagen).</td>
</tr>
<tr>
 <td>Ctrl+0</td>
 <td><img src="../../icons/zoom-orig-16.png" /></td>
 <td>Mostrar la imagen con el tama&ntilde;o original (solo en modo de imagen).</td>
</tr>
<tr>
 <td>Ctrl+A</td>
 <td></td>
 <td>Seleccionar todo el texto (modos binario y de texto).</td>
</tr>
<tr>
 <td>Ctrl+C</td>
 <td><img src="../../icons/edit-copy-16.png" /></td>
 <td>Copiar el texto seleccionado o la imagen actual al Portapapeles.</td>
</tr>
<tr>
 <td>Ctrl+F</td>
 <td><img src="../../icons/find-text-16.png" /></td>
 <td>Buscar el texto especificado (solo en modo de texto).</td>
</tr>
<tr>
 <td>Ctrl+G</td>
 <td><img src="../../icons/goto-16.png" /></td>
 <td>Ir a la l&iacute;nea especificada (solo en modo de texto).</td>
</tr>
<tr>
 <td>Ctrl+R</td>
 <td><img src="../../icons/refresh-16.png" /></td>
 <td>Volver a cargar el archivo actual.</td>
</tr>
</table>

</body>
</html>
